# Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма,
# която изчислява разходите за ремонта, предвид следните цени:
# •	Предпазен найлон - 1.50 лв. за кв. метър
# •	Боя - 14.50 лв. за литър
# •	Разредител за боя - 5.00 лв. за литър
# За всеки случай, към необходимите материали, Румен иска да добави още
# 10% от количеството боя и
# 2 кв.м. найлон, разбира се и
# 0.40 лв. за торбички.
# Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
# Вход
# Входът се чете от конзолата и съдържа точно 4 реда:
# 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
# 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
# 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
# 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
# Изход
# Да се отпечата на конзолата един ред:
# •	"{сумата на всички разходи}"

NYLON_SQM_PRICE = 1.50
PAINT_PRICE = 14.50
RAZREDITEL_PRICE = 5.00
ADD_PAINT = 10/100
ADD_NYLON = 2
ADD_BAGS = 0.40
MAISTORI_PAY_PER_HOUR = 30/100

nylon = int(input())
paint = int(input())
razreditel = int(input())
work_hours = int(input())

sum_materials = (NYLON_SQM_PRICE * (nylon + ADD_NYLON)
                 + PAINT_PRICE * (paint + paint*ADD_PAINT)
                 + RAZREDITEL_PRICE * razreditel
                 + ADD_BAGS)
sum_workers_per_hour = (MAISTORI_PAY_PER_HOUR * sum_materials) * work_hours

sum = sum_materials + sum_workers_per_hour

print(sum)