# Петя има магазин за детски играчки.
# Тя получава голяма поръчка, която трябва да изпълни.
# С парите, които ще спечели иска да отиде на екскурзия.
# Цени на играчките:
# •	Пъзел - 2.60 лв.
# •	Говореща кукла - 3 лв.
# •	Плюшено мече - 4.10 лв.
# •	Миньон - 8.20 лв.
# •	Камионче - 2 лв.
# Ако поръчаните играчки са 50 или повече магазинът прави отстъпка 25% от общата цена.
# От спечелените пари Петя трябва да даде 10% за наема на магазина.
# Да се пресметне дали парите ще ѝ стигнат да отиде на екскурзия.
# Вход
# От конзолата се четат 6 реда:
# 1.	Цена на екскурзията - реално число в интервала [1.00 … 10000.00]
# 2.	Брой пъзели - цяло число в интервала [0… 1000]
# 3.	Брой говорещи кукли - цяло число в интервала [0 … 1000]
# 4.	Брой плюшени мечета - цяло число в интервала [0 … 1000]
# 5.	Брой миньони - цяло число в интервала [0 … 1000]
# 6.	Брой камиончета - цяло число в интервала [0 … 1000]
# Изход
# На конзолата се отпечатва:
# •	Ако парите са достатъчни се отпечатва:
# o	"Yes! {оставащите пари} lv left."
# •	Ако парите НЕ са достатъчни се отпечатва:
# o	"Not enough money! {недостигащите пари} lv needed."
#
# Резултатът трябва да се форматира до втория знак след десетичната запетая.


PUZZLE = 2.60
DOLL = 3
TEDDY = 4.10
MINION = 8.20
TRUCK = 2

TOYS_DISCOUNT_LIMIT = 50
DISCOUNT = 25/100
RENT_PERC = 10/100



trip_price = float(input())
puzzle_cnt = int(input())
doll_cnt = int(input())
teddy_cnt = int(input())
minion_cnt = int(input())
truck_cnt = int(input())

sum = ( (puzzle_cnt * PUZZLE)
       + (doll_cnt * DOLL)
       + (teddy_cnt * TEDDY)
       + (minion_cnt * MINION)
       + (truck_cnt * TRUCK))

toys_cnt = puzzle_cnt + doll_cnt + teddy_cnt + minion_cnt + truck_cnt

if toys_cnt >= TOYS_DISCOUNT_LIMIT:
    sum -= sum*DISCOUNT

sum -= sum * RENT_PERC

if sum >= trip_price:
    print(f"Yes! {sum - trip_price:.2f} lv left.")
else:
    print(f"Not enough money! {trip_price - sum:.2f} lv needed.")