# Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета
# и котки.
# Храната се пазарува от зоомагазин, като
# една опаковка храна за кучета е на цена 2.50 лв, а
# опаковка храна за котки струва 4 лв.
# Вход
# От конзолата се четат 2 реда:
# 1.	Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
# 2.	Броят на опаковките храна за котки –  цяло число в интервала [0… 100]
# Изход
# На конзолата се отпечатва:
# "{крайната сума} lv."

DOG_FOOD_PRICE = 2.50
CAT_FOOD_PRICE = 4

dog_food_cnt = int(input())
cat_food_cnt = int(input())

expence = DOG_FOOD_PRICE * dog_food_cnt + CAT_FOOD_PRICE * cat_food_cnt

print(f"{expence} lv.")
